# Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None
print(string_data)

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
cleaned_how = data.dropna(how='all')
cleaned_how

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[2]

0    3.0
1    NaN
2    NaN
3    3.0
Name: 2, dtype: float64

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -1.338392  1.482199  0.358022
1  0.902510 -0.588771 -1.084206
2  0.173120 -0.196963 -1.779390
3  0.931721 -1.676101  1.348320
4  0.015945  0.479742 -0.735035
5  2.458107 -1.128841  1.241821
6  0.247163  0.150954 -1.018854

In [15]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [16]:
df

          0         1         2
0 -1.338392       NaN       NaN
1  0.902510       NaN       NaN
2  0.173120       NaN -1.779390
3  0.931721       NaN  1.348320
4  0.015945  0.479742 -0.735035
5  2.458107 -1.128841  1.241821
6  0.247163  0.150954 -1.018854

In [17]:
df.dropna()

          0         1         2
4  0.015945  0.479742 -0.735035
5  2.458107 -1.128841  1.241821
6  0.247163  0.150954 -1.018854

In [18]:
df.dropna(thresh=2)

          0         1         2
2  0.173120       NaN -1.779390
3  0.931721       NaN  1.348320
4  0.015945  0.479742 -0.735035
5  2.458107 -1.128841  1.241821
6  0.247163  0.150954 -1.018854

## Filling In Missing Data

In [19]:
import pandas as pd

In [20]:
df.fillna(0)

          0         1         2
0 -1.338392  0.000000  0.000000
1  0.902510  0.000000  0.000000
2  0.173120  0.000000 -1.779390
3  0.931721  0.000000  1.348320
4  0.015945  0.479742 -0.735035
5  2.458107 -1.128841  1.241821
6  0.247163  0.150954 -1.018854

In [21]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.338392  0.500000  0.000000
1  0.902510  0.500000  0.000000
2  0.173120  0.500000 -1.779390
3  0.931721  0.500000  1.348320
4  0.015945  0.479742 -0.735035
5  2.458107 -1.128841  1.241821
6  0.247163  0.150954 -1.018854

In [22]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.338392  0.000000  0.000000
1  0.902510  0.000000  0.000000
2  0.173120  0.000000 -1.779390
3  0.931721  0.000000  1.348320
4  0.015945  0.479742 -0.735035
5  2.458107 -1.128841  1.241821
6  0.247163  0.150954 -1.018854

In [23]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.239065  1.656384  1.412940
1 -0.253854  0.383992 -1.297764
2  0.027013       NaN -0.942434
3 -1.376776       NaN -0.724406
4  1.119003       NaN       NaN
5 -1.059321       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0  0.239065  1.656384  1.412940
1 -0.253854  0.383992 -1.297764
2  0.027013  0.383992 -0.942434
3 -1.376776  0.383992 -0.724406
4  1.119003  0.383992 -0.724406
5 -1.059321  0.383992 -0.724406

In [25]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.239065  1.656384  1.412940
1 -0.253854  0.383992 -1.297764
2  0.027013  0.383992 -0.942434
3 -1.376776  0.383992 -0.724406
4  1.119003       NaN -0.724406
5 -1.059321       NaN -0.724406

In [26]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [27]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)

In [32]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [35]:
data.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [36]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [37]:
lowercase = data['food'].str.lower()
lowercase

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [38]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [39]:
data['animal'] = lowercase.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [40]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [41]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [42]:
import numpy as np
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [44]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [45]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [46]:
import numpy as np
import pandas as pd

In [47]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [48]:
transform = lambda x: x[:4].upper()

In [49]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [50]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [51]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [52]:
data.rename(index=str.title,columns=str.upper, inplace = True)
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [53]:
data.rename(index={'Ohio':'Dublin'},columns = {'THREE':'peekaboo'})

        ONE  TWO  peekaboo  FOUR
Dublin    0    1         2     3
Colo      4    5         6     7
New       8    9        10    11

In [54]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

# Discretization and Binning

In [55]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [56]:
bins = [18, 25, 35, 60, 100]

In [57]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [58]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [59]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [60]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [61]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [62]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [63]:
data = np.random.rand(20)
data

array([0.79696775, 0.4300062 , 0.76365324, 0.57947139, 0.68422117,
       0.24265891, 0.43227054, 0.49222789, 0.64298878, 0.42942682,
       0.44302866, 0.67180394, 0.43688778, 0.33155556, 0.67776763,
       0.82094193, 0.72891846, 0.49968246, 0.00307895, 0.12501775])

In [64]:
cats = pd.cut(data, 4, precision=2)
cats

[(0.62, 0.82], (0.41, 0.62], (0.62, 0.82], (0.41, 0.62], (0.62, 0.82], ..., (0.62, 0.82], (0.62, 0.82], (0.41, 0.62], (0.0023, 0.21], (0.0023, 0.21]]
Length: 20
Categories (4, interval[float64]): [(0.0023, 0.21] < (0.21, 0.41] < (0.41, 0.62] < (0.62, 0.82]]

In [65]:
pd.value_counts(cats)

(0.62, 0.82]      8
(0.41, 0.62]      8
(0.21, 0.41]      2
(0.0023, 0.21]    2
dtype: int64

In [66]:
data = np.random.randn(1000)
data[:10]

array([-0.54013131, -0.98363926, -1.67761322,  0.99613835,  0.77663458,
        0.19430578, -0.09616648,  0.20744478, -0.77908023,  1.18027278])

In [67]:
cats = pd.qcut(data,4)

In [68]:
cats

[(-0.685, 0.052], (-3.303, -0.685], (-3.303, -0.685], (0.745, 3.646], (0.745, 3.646], ..., (0.052, 0.745], (-0.685, 0.052], (0.052, 0.745], (-3.303, -0.685], (0.745, 3.646]]
Length: 1000
Categories (4, interval[float64]): [(-3.303, -0.685] < (-0.685, 0.052] < (0.052, 0.745] < (0.745, 3.646]]

In [69]:
pd.value_counts(cats)

(0.745, 3.646]      250
(0.052, 0.745]      250
(-0.685, 0.052]     250
(-3.303, -0.685]    250
dtype: int64

In [70]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.325, 0.052], (-1.325, 0.052], (-3.303, -1.325], (0.052, 1.328], (0.052, 1.328], ..., (0.052, 1.328], (-1.325, 0.052], (0.052, 1.328], (-3.303, -1.325], (1.328, 3.646]]
Length: 1000
Categories (4, interval[float64]): [(-3.303, -1.325] < (-1.325, 0.052] < (0.052, 1.328] < (1.328, 3.646]]

# Detecting and Filtering Outliers

In [10]:
import pandas as pd
import numpy as np
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.079296     0.031126    -0.025662     0.050800
std       1.014019     1.002913     1.038683     0.961809
min      -3.463249    -3.021298    -3.666807    -2.849569
25%      -0.733645    -0.655337    -0.740447    -0.609341
50%      -0.083182     0.031971     0.004097    -0.006199
75%       0.623279     0.652392     0.670658     0.661479
max       3.114517     2.990805     3.089245     2.759830

In [11]:
data.head(3)

          0         1         2         3
0 -0.527141 -1.567102  0.040457 -0.553898
1 -0.928772  0.071417 -0.718871 -0.118780
2 -0.363999  0.027803 -0.108575 -0.599528

In [12]:
col = data[2]

In [13]:
col[np.abs(col)>2]

33    -2.056262
70     2.015797
85    -3.666807
99     2.775006
135   -2.112038
164    2.140921
170    2.872588
175    2.235514
183   -2.588204
204    2.171218
208    2.766237
245   -2.142348
282    2.146503
301    2.683210
319   -2.558240
349   -2.050617
361   -2.498739
388   -2.485423
398   -2.814316
427   -2.473987
438   -2.905113
465    2.184089
475    2.102667
480   -2.427973
482   -2.347164
559   -2.512208
588   -2.792092
593   -2.038058
611   -2.010729
622    2.956675
623   -2.278738
651   -2.312199
667    2.798659
677   -2.223404
688    2.791677
694   -2.327059
699   -2.132692
708   -2.494173
735   -2.003982
787   -2.612827
798   -2.336754
806    2.357047
828   -2.270421
830   -2.215713
833   -2.727412
858   -2.745246
875    2.058725
886    3.089245
916   -3.474050
923    2.373723
926   -2.221072
935    2.411217
953    2.672081
957   -2.021182
982   -2.614094
Name: 2, dtype: float64

In [5]:
data[(np.abs(data)>3)]

      0   1        2   3
0   NaN NaN      NaN NaN
1   NaN NaN      NaN NaN
2   NaN NaN      NaN NaN
3   NaN NaN      NaN NaN
4   NaN NaN      NaN NaN
5   NaN NaN      NaN NaN
6   NaN NaN      NaN NaN
7   NaN NaN      NaN NaN
8   NaN NaN      NaN NaN
9   NaN NaN      NaN NaN
10  NaN NaN      NaN NaN
11  NaN NaN      NaN NaN
12  NaN NaN      NaN NaN
13  NaN NaN      NaN NaN
14  NaN NaN      NaN NaN
15  NaN NaN      NaN NaN
16  NaN NaN      NaN NaN
17  NaN NaN      NaN NaN
18  NaN NaN      NaN NaN
19  NaN NaN      NaN NaN
20  NaN NaN      NaN NaN
21  NaN NaN      NaN NaN
22  NaN NaN      NaN NaN
23  NaN NaN      NaN NaN
24  NaN NaN      NaN NaN
25  NaN NaN      NaN NaN
26  NaN NaN      NaN NaN
27  NaN NaN      NaN NaN
28  NaN NaN      NaN NaN
29  NaN NaN      NaN NaN
..   ..  ..      ...  ..
970 NaN NaN      NaN NaN
971 NaN NaN      NaN NaN
972 NaN NaN      NaN NaN
973 NaN NaN      NaN NaN
974 NaN NaN      NaN NaN
975 NaN NaN      NaN NaN
976 NaN NaN      NaN NaN
977 NaN NaN      NaN NaN
978 NaN NaN      NaN NaN
979 NaN NaN      NaN NaN
980 NaN NaN      NaN NaN
981 NaN NaN      NaN NaN
982 NaN NaN      NaN NaN
983 NaN NaN      NaN NaN
984 NaN NaN      NaN NaN
985 NaN NaN      NaN NaN
986 NaN NaN -3.86786 NaN
987 NaN NaN      NaN NaN
988 NaN NaN      NaN NaN
989 NaN NaN      NaN NaN
990 NaN NaN      NaN NaN
991 NaN NaN      NaN NaN
992 NaN NaN      NaN NaN
993 NaN NaN      NaN NaN
994 NaN NaN      NaN NaN
995 NaN NaN      NaN NaN
996 NaN NaN      NaN NaN
997 NaN NaN      NaN NaN
998 NaN NaN      NaN NaN
999 NaN NaN      NaN NaN

[1000 rows x 4 columns]

In [6]:
data[(np.abs(data)>3)][22:23]

     0   1   2   3
22 NaN NaN NaN NaN

In [7]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
34  -0.012163 -0.145395 -3.133558  0.230784
61  -1.514570  0.825885  3.136060 -1.078588
154  1.386944  3.041716  0.082411 -0.649072
335  0.689336 -0.644263  1.542940  3.014544
377  3.130692 -0.138536 -0.113479 -1.671993
420 -0.785593  1.741457 -3.390833 -2.258628
577  0.015452 -0.668403  3.184180 -0.497883
590 -0.453530 -1.139828 -1.158149  3.384157
731  1.003716 -0.299423  3.116936  0.775904
986 -1.315970  0.289887 -3.867860 -0.722100

In [8]:
np.sign(data) * 3

       0    1    2    3
0   -3.0 -3.0 -3.0 -3.0
1    3.0  3.0 -3.0  3.0
2    3.0 -3.0 -3.0 -3.0
3    3.0 -3.0 -3.0 -3.0
4    3.0 -3.0  3.0 -3.0
5   -3.0  3.0 -3.0 -3.0
6    3.0 -3.0  3.0  3.0
7    3.0 -3.0 -3.0 -3.0
8   -3.0 -3.0 -3.0 -3.0
9    3.0 -3.0  3.0 -3.0
10  -3.0  3.0 -3.0  3.0
11  -3.0 -3.0  3.0 -3.0
12  -3.0  3.0 -3.0  3.0
13   3.0 -3.0 -3.0  3.0
14   3.0 -3.0  3.0 -3.0
15  -3.0  3.0  3.0 -3.0
16  -3.0 -3.0  3.0 -3.0
17  -3.0  3.0  3.0  3.0
18   3.0  3.0  3.0  3.0
19  -3.0 -3.0  3.0 -3.0
20  -3.0  3.0  3.0 -3.0
21   3.0  3.0 -3.0 -3.0
22   3.0  3.0  3.0  3.0
23  -3.0  3.0  3.0  3.0
24   3.0  3.0 -3.0  3.0
25  -3.0  3.0 -3.0  3.0
26   3.0  3.0 -3.0  3.0
27  -3.0 -3.0 -3.0 -3.0
28   3.0  3.0  3.0 -3.0
29  -3.0  3.0 -3.0  3.0
..   ...  ...  ...  ...
970  3.0  3.0 -3.0  3.0
971  3.0  3.0  3.0 -3.0
972  3.0  3.0  3.0  3.0
973  3.0 -3.0 -3.0 -3.0
974 -3.0  3.0  3.0  3.0
975  3.0  3.0  3.0 -3.0
976 -3.0 -3.0  3.0 -3.0
977  3.0 -3.0  3.0  3.0
978  3.0  3.0  3.0  3.0
979  3.0 -3.0 -3.0 -3.0
980 -3.0  3.0 -3.0 -3.0
981 -3.0 -3.0 -3.0 -3.0
982 -3.0  3.0 -3.0 -3.0
983 -3.0  3.0  3.0 -3.0
984 -3.0  3.0 -3.0  3.0
985  3.0  3.0 -3.0 -3.0
986 -3.0  3.0 -3.0 -3.0
987  3.0 -3.0 -3.0  3.0
988  3.0  3.0 -3.0 -3.0
989 -3.0  3.0  3.0 -3.0
990  3.0 -3.0 -3.0  3.0
991  3.0  3.0 -3.0 -3.0
992  3.0 -3.0  3.0  3.0
993 -3.0 -3.0  3.0 -3.0
994  3.0 -3.0 -3.0 -3.0
995 -3.0 -3.0  3.0  3.0
996 -3.0 -3.0  3.0  3.0
997 -3.0 -3.0 -3.0 -3.0
998  3.0 -3.0 -3.0  3.0
999  3.0 -3.0  3.0  3.0

[1000 rows x 4 columns]

In [9]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.head()

          0         1         2         3
0 -0.564522 -0.888740 -0.712508 -0.477190
1  0.039235  0.909502 -0.726863  0.210823
2  0.260736 -0.886255 -0.602586 -0.051039
3  1.785868 -0.967884 -1.403081 -0.380218
4  0.041212 -0.601182  0.145689 -0.613552

In [80]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.013170    -0.029359     0.000185     0.010361
std       1.021464     0.974418     0.974146     0.975616
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.679931    -0.668318    -0.681541    -0.662867
50%      -0.029992    -0.038417     0.026182    -0.030848
75%       0.646831     0.628506     0.656137     0.659866
max       3.000000     3.000000     3.000000     3.000000

In [81]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1 -1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0 -1.0 -1.0  1.0

In [82]:
data.head()

          0         1         2         3
0  0.059178 -2.035950  0.146753 -0.383972
1 -0.224111 -1.370369 -1.575095 -0.969885
2 -1.239445 -0.361255  1.213857 -1.381125
3 -1.049988 -0.076354 -0.375015  2.139860
4 -1.044606 -0.317949 -1.067332  1.084438

In [83]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [84]:
sampler = np.random.permutation(5)
sampler

array([1, 2, 3, 4, 0])

In [85]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

In [86]:
df.sample(3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [87]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [88]:
draws = choices.sample(10,replace=True)
draws

1    7
1    7
2   -1
2   -1
1    7
0    5
1    7
2   -1
2   -1
2   -1
dtype: int64

# Computing Indicator/Dummy Variables

In [89]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [90]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [91]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [92]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [93]:
mnames = ['movie_id', 'title', 'genres']

In [94]:
movies = pd.read_table('movies.dat', sep='::',
header=None, names=mnames)

C:\Users\talhakhalidx24\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

C:\Users\talhakhalidx24\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [95]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [96]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [97]:
zero_matrix = np.zeros((len(movies),len(genres)))

In [98]:
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [99]:
gen  = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [100]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [101]:
len(movies.genres)

3883

In [102]:
for i , gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [103]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [104]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [105]:
movies_windic[0:5]

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [106]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [107]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [108]:
pd.cut(values, bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [109]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# String Manipulation

In [110]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [111]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [112]:
import numpy as np
import pandas as pd

In [113]:
first,second, third = pieces

In [114]:
first + '::' + second + '::' + third

'a::b::guido'

In [115]:
first + ',' + second + '::' + third

'a,b::guido'

In [116]:
'::'.join(pieces)

'a::b::guido'

In [117]:
'guido' in val

True

In [118]:
val.index(',')

1

In [119]:
val.find(':')

-1

In [120]:
val.count(',')

2

In [121]:
val.replace(',',"::")

'a::b:: guido'

In [122]:
val.replace(',','')

'ab guido'

In [123]:
import re
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [124]:
regex = re.compile('\s+')

In [125]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [126]:
regex.findall(text)

[' ', '\t ', ' \t']

In [127]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [128]:
regex.split(text)

['Dave ', '\nSteve ', '\nRob ', '\nRyan ', '\n']

In [129]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [130]:
m = regex.search(text)
m

In [131]:
text[m.start():m.end()]

'dave@google.com'

In [132]:
# regex.match returns None, as it only will match if the pattern occurs at the start of the
# string:
print(regex.match(text))

None

In [133]:
# Relatedly, sub will return a new string with occurrences of the pattern replaced by the
# a new string:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [134]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [135]:
m = regex.match('wesm@bright.net')
m

In [136]:
m.groups()

('wesm', 'bright', 'net')

In [137]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [138]:
print(regex.sub(r'Username:\1, Domain:\2, Suffix:\3',text))

Dave Username:dave, Domain:google, Suffix:com
Steve Username:steve, Domain:gmail, Suffix:com
Rob Username:rob, Domain:gmail, Suffix:com
Ryan Username:ryan, Domain:yahoo, Suffix:com

# Vectorized String Functions in pandas

In [139]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [140]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [141]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [142]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [143]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [144]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [145]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [146]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [147]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object